In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.3.1'

# DataFrame

In [3]:
dataset = {
    'Name':["sumon","galib","junaed","kamrul"],
    'passing year': ["2023","2024","2022","2023"]
    
}

In [4]:
var1 = pd.DataFrame(dataset)

In [5]:
print(var1)

     Name passing year
0   sumon         2023
1   galib         2024
2  junaed         2022
3  kamrul         2023

# Series

In [6]:
var2 = ["sumon","galib","nerob","kamrul"]

In [7]:
pd.Series(var2)

0     sumon
1     galib
2     nerob
3    kamrul
dtype: object

In [28]:
pd.Series(var2,index=["w","x","y","z"])

w     sumon
x     galib
y     nerob
z    kamrul
dtype: object

In [25]:
var3 = {"sumon":2023,"kamrul":2023,"galib":2024}

In [26]:
pd.Series(var3)

sumon     2023
kamrul    2023
galib     2024
dtype: int64

# DataFrame to csv

In [13]:
dataset = {
    'Name':["sumon","galib","junaed","kamrul"],
    'passing year': ["2023","2024","2022","2023"],
    'Institute': ["MIST","RUET","AIUB","MIST"]
    
}

In [15]:
df = pd.DataFrame(dataset)
df.to_csv("data1.csv",index=False)

In [22]:
df1 = pd.read_csv("data1.csv")

In [25]:
df1.head()

     Name  passing year Institute
0   sumon          2023      MIST
1   galib          2024      RUET
2  junaed          2022      AIUB
3  kamrul          2023      MIST

In [26]:
df1.tail()

     Name  passing year Institute
0   sumon          2023      MIST
1   galib          2024      RUET
2  junaed          2022      AIUB
3  kamrul          2023      MIST

In [27]:
df1.describe()

       passing year
count      4.000000
mean    2023.000000
std        0.816497
min     2022.000000
25%     2022.750000
50%     2023.000000
75%     2023.250000
max     2024.000000